read_verilog blinky.v
synth_ice40 -top blinky
write_json blinky.json
