read_verilog blinky.v
synth_xilinx -top blinky
write_json blinky.json
