read_verilog icebreaker.v
synth_ice40 -nocarry -top icebreaker
write_json icebreaker.json
