read_verilog blinky.v
synth_ice40 -top blinky -nocarry
write_json blinky.json
