read_verilog icebreaker.v
read_verilog -lib +/ice40/cells_sim.v
synth -top icebreaker
abc -lut 4
techmap -map blinky_map.v
splitnets
opt_clean
stat
write_json icebreaker.json
